<!-- dflook/terraform-github-actions {"workspace":"isolate-home","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"c715cc626da9d2f10282a05cea739a4b06e22237aa2518c2f55f76c602126f99","plan_job_ref":"Job Test plan target and replace #383 at https://github.com/dflook/terraform-github-actions/actions/runs/7280689481","plan_hash":"563d438d4bb53d16819027bbb2ba5957fcd8ead3f76a76f05d68fe9118a9efb5","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __isolate-home__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "0Xgb7BTZYE" -> (known after apply)
!~  foreach = "4mtabHxWNo" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #383](https://github.com/dflook/terraform-github-actions/actions/runs/7280689481)